In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [2]:
%%sql
create database if not exists tutorial

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [3]:
%%sql
use tutorial

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [6]:
%%sql
show databases

 * mysql+mysqlconnector://root:***@localhost/test
10 rows affected.

[('customers',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('tutorial',),
 ('uber',),
 ('world',)]

In [10]:
%%sql
CREATE TABLE if not exists CustomerTransactions (
    id INT PRIMARY KEY,
    login_device VARCHAR(50),
    customer_name VARCHAR(100),
    ip_address VARCHAR(20),
    product VARCHAR(100),
    amount DECIMAL(10, 2),
    is_placed BOOLEAN,
    is_viewed BOOLEAN,
    transaction_status VARCHAR(20)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [12]:
%%sql
INSERT INTO CustomerTransactions VALUES
(1, 'Mobile', 'Ravi', '192.168.1.1', 'Laptop', 50000.00, TRUE, FALSE, 'Completed'),
(2, 'Desktop', 'Priya', '192.168.1.2', 'Smartphone', 20000.00, TRUE, TRUE, 'Completed'),
(3, 'Tablet', 'Arjun', '192.168.1.3', 'Headphones', 1500.00, FALSE, TRUE, 'Failed'),
(4, 'Mobile', 'Meena', '192.168.1.4', 'Shoes', 2500.00, TRUE, FALSE, 'Completed'),
(5, 'Desktop', 'Karthik', '192.168.1.5', 'Watch', 5000.00, TRUE, TRUE, 'Completed'),
(6, 'Mobile', 'Somyya', '192.168.1.6', 'Tablet', 15000.00, TRUE, TRUE, 'Completed'),
(7, 'Tablet', 'Ramesh', '192.168.1.7', 'Smartphone', 25000.00, FALSE, TRUE, 'Failed'),
(8, 'Desktop', 'Divya', '192.168.1.8', 'Laptop', 60000.00, TRUE, FALSE, 'Completed'),
(9, 'Mobile', 'Arun', '192.168.1.9', 'Smartwatch', 12000.00, TRUE, TRUE, 'Completed'),
(10, 'Tablet', 'Deepa', '192.168.1.10', 'Laptop', 55000.00, FALSE, FALSE, 'Pending');

 * mysql+mysqlconnector://root:***@localhost/test
10 rows affected.

[]

In [16]:
%%sql
select count(*) from CustomerTransactions;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(10,)]

In [20]:
%%sql
select count(*) from CustomerTransactions where transaction_status= 'Failed'

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(2,)]

In [21]:
%%sql
select count(*) from CustomerTransactions where transaction_status= 'Failed' and product='Laptop'

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(0,)]

In [29]:
%%sql
select count(*) from CustomerTransactions where transaction_status='Failed' or transaction_status='Pending'

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(3,)]

Above and Below code gives the result

In [22]:
%%sql

select count(*) from CustomerTransactions where transaction_status in('Failed','Pending')

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(3,)]

In [37]:
%%sql
select count(*) from CustomerTransactions where transaction_status not in('Failed','Pending')

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(7,)]

In [39]:
%%sql
select sum(amount) as Total from CustomerTransactions where transaction_status = 'Completed'

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('164500.00'),)]

In [40]:
%%sql
select avg(amount) as Average from CustomerTransactions

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('24600.000000'),)]

In [42]:
%%sql
select login_device,
sum(amount) as total_amount
from CustomerTransactions

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1140 (42000): In aggregated query without GROUP BY, expression #1 of SELECT list contains nonaggregated column 'de_project.CustomerTransactions.login_device'; this is incompatible with sql_mode=only_full_group_by
[SQL: select login_device,
sum(amount) as total_amount
from CustomerTransactions]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [43]:
%%sql
select login_device,
sum(amount) as total_amount
from CustomerTransactions
group by login_device

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Mobile', Decimal('79500.00')),
 ('Desktop', Decimal('85000.00')),
 ('Tablet', Decimal('81500.00'))]

HAVING IS USED FOR AGGREGATED COLUMNS AND WHERE CAN ONLY BE USED FOR NON-AGGREGATED COLUMNS

In [49]:
%%sql
select login_device,
sum(amount) as total_amount
from CustomerTransactions
group by login_device
HAVING 
sum(amount) > 80000;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[('Desktop', Decimal('85000.00')), ('Tablet', Decimal('81500.00'))]

In [50]:
%%sql
select login_device,
sum(amount) as total_amount
from CustomerTransactions
group by login_device
HAVING 
amount > 80000;
--Having can only process aggregated columns

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1054 (42S22): Unknown column 'amount' in 'having clause'
[SQL: select login_device,
sum(amount) as total_amount
from CustomerTransactions
group by login_device
HAVING
amount > 80000;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [53]:
%%sql
--amount is a non aggregated column
select login_device,
sum(amount) as total_amount
from CustomerTransactions
where amount>80000
group by login_device

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]